{
    "banner": {
      "tagline": "Welcome to my Portfolio",
      "greeting": "Hi! I'm Lucas Gomes",
      "backendDev": "Backend Dev",
      "dataAnalyst": "Data Analyst",
      "fullstackDev": "Fullstack Dev",
      "description": "Hello, my name is Lucas Gomes, it's a pleasure to meet you! I'm a curious and dedicated Back-end developer committed to continuous learning. I have a proactive spirit that seeks effective solutions and new operational perspectives for the team. If you're looking for a programmer who can bring technical skills along with a wide range of soft skills and a strong commitment to productivity and innovation, you've just found one. Let's connect! I hold a degree in Technology in Systems Analysis and Development at IFMS, I'm eager to contribute and grow in the tech world.",
      "button": "Let's Connect!"
    },
    "contact": {
        "title": "Get in Touch",
        "firstName": "First Name",
        "lastName": "Last Name",
        "email": "Email Address",
        "phone": "Phone No.",
        "message": "Message",
        "send": "Send",
        "sending": "Sending...",
        "successMessage": "Message sent successfully!",
        "errorMessage": "Something went wrong. Please try again later or talk to me on LinkedIn.",
        "button": "Let's Connect!",
        "contactImageAlt": "Contact Me"
    },
    "footer": {
        "copyright": "LDSG Copyright {{year}}. All Rights Reserved"
    },
    "navbar": {
        "home": "Home",
        "skills": "Skills",
        "projects": "Projects",
        "connect": "Let's Connect!",
        "translate": "Translate Page"
    },
    "projects": {
        "title": "Projects",
        "introduction": "My portfolio highlights a diverse range of full-stack projects, demonstrating expertise in modern technologies such as React, TypeScript, Django, Go, and Data Analysis in general. Each project reflects my ability to design and implement scalable applications, from financial tools to CRM systems and interactive bots. With a strong focus on usability and efficiency, my work combines intuitive interfaces with robust back-end solutions, reflecting a commitment to quality and adaptability in real-world applications.",
        "csvAnalysis": {
            "description": "Exploratory Data Analysis (EDA) to identify patterns and relationships between variables related to the job market, such as professional experience, age, salary, workload, and performance evaluation."
        },
        "django": {
            "description": "CRM system developed with Django to manage customers, leads, and interactions, improving customer relationship management processes."
        },
        "techInterview": {
            "description": "A full-stack platform designed to train candidates with logic questions, coding challenges, soft skills, and practical scenarios, providing automated feedback. Built with Next.js on the frontend and FastAPI on the backend."
        },
        "spreadSheetAuto": {
            "description": "This project aims to automate the generation and delivery of sales reports from Excel spreadsheets. It processes data using Pandas, generates a formatted PDF report with ReportLab, and automatically sends it via email using Yagmail."
        },
        "pokeHub": {
            "description": "A modern full-stack application that consumes the PokeAPI to display information about Pokémon, developed with Next.js on the frontend and FastAPI on the backend. Involving AI and data analysis development with internal consumption in Postman."
        },
        "emotionTrack": {
            "description": "Artificial Intelligence (AI)-based software designed to identify and analyze facial microexpressions in real time, aiming to map human emotions during remote interactions. The system integrates a chatbot capable of interpreting emotions from typed text and a dashboard that displays analyses of facial expressions captured via webcam."
        }
    },
    "skills": {
        "title": "Skills",
        "introduction": "I'm a versatile and adaptable developer with a passion for technology and design. I excel in creating engaging and user-friendly interfaces using HTML, CSS, JavaScript, TypeScript, and React. With experience in Python (Django), Golang (Gin), among other languages, I deliver promising projects in the job market.",
        "html_css": {
        "title": "HTML & CSS",
        "description": "Experienced in creating attractive and user-friendly interfaces using HTML and CSS, focusing on usability and responsive design."
        },
        "javascript_typescript": {
        "title": "JavaScript & TypeScript",
        "description": "Excellence in developing dynamic and interactive interfaces with JavaScript and TypeScript."
        },
        "react": {
        "title": "React/NextJS",
        "description": "Creating interactive and high-performance applications in React and Next.js, utilizing hooks and state management for optimal usability."
        },
        "python_django": {
        "title": "Python & Django",
        "description": "Developing robust and scalable solutions with Python and Django, focusing on efficiency and security. (Pandas, Streamlit, Numpy)"
        },
        "golang_gin": {
        "title": "GoLang & Gin",
        "description": "Implementing high-performance backend applications with low latency using GoLang and the Gin framework."
        },
        "mysql_postgresql": {
        "title": "MySQL & PostgreSQL",
        "description": "Expertise in managing databases with MySQL and PostgreSQL, ensuring data integrity and optimal query performance."
        }
    }
}
  