{
    "banner": {
        "tagline": "Bem-vindo ao meu Portfólio",
        "greeting": "Oi! Eu sou Lucas Gomes",
        "description": "Olá, meu nome é Lucas Gomes, é um prazer conhecê-lo! Sou um desenvolvedor Back-end curioso e dedicado, comprometido com o aprendizado contínuo. Tenho um espírito proativo que busca soluções eficazes e novas perspectivas operacionais para a equipe. Se você está procurando um programador que possa trazer habilidades técnicas, juntamente com uma ampla gama de habilidades interpessoais e um forte compromisso com a produtividade e a inovação, você acabou de encontrar. Vamos nos conectar! Possuo formação em Tecnologia em Análise e Desenvolvimento de Sistemas, ansioso para contribuir e crescer no mundo Tech!",
        "button": "Vamos Conectar!"
    },
    "contact": {
        "title": "Entre em Contato",
        "firstName": "Nome",
        "lastName": "Sobrenome",
        "email": "Endereço de Email",
        "phone": "Telefone",
        "message": "Mensagem",
        "send": "Enviar",
        "sending": "Enviando...",
        "successMessage": "Mensagem enviada com sucesso!",
        "errorMessage": "Algo deu errado. Por favor, tente novamente mais tarde.",
        "button": "Vamos Conectar!",
        "contactImageAlt": "Entre em Contato"
    },
    "footer": {
        "copyright": "LDSG Copyright {{year}}. Todos os Direitos Reservados"
    },
    "navbar": {
        "home": "Início",
        "skills": "Habilidades",
        "projects": "Projetos",
        "connect": "Vamos Conectar!",
        "translate": "Traduzir Página"
    },
    "projects": {
        "title": "Projetos",
        "introduction": "Meu portfólio destaca uma variedade de projetos full-stack, demonstrando experiência em tecnologias modernas, como React, TypeScript, Django, Go e Análise de Dados em geral. Cada projeto reflete minha capacidade de projetar e implementar aplicações escaláveis, desde ferramentas financeiras até sistemas de CRM e bots interativos. Com foco em usabilidade e eficiência, meu trabalho combina interfaces intuitivas com soluções robustas de back-end, refletindo um compromisso com qualidade e adaptabilidade em aplicações do mundo real.",
        "csvAnalysis": {
        "description": "Análise exploratória de dados (EDA) para identificar padrões e relações entre variáveis relacionadas ao mercado de trabalho, como experiência profissional, idade, salário, carga horária e avaliação de desempenho."
        },
        "django": {
        "description": "Sistema CRM desenvolvido em Django para gerenciar clientes, leads e interações, aprimorando processos de relacionamento com clientes."
        },
        "techInterview": {
        "description": "Simulador de Entrevista Técnica Uma plataforma full-stack para treinar candidatos com perguntas de lógica, código, soft skills e cenários práticos, fornecendo feedback automático. Desenvolvida com Next.js no frontend e FastAPI no backend."
        },
        "spreadSheetAuto": {
        "description": "Este projeto tem como objetivo automatizar a geração e o envio de relatórios de vendas a partir de planilhas Excel. Ele processa os dados com Pandas, cria um relatório em PDF formatado usando ReportLab, e o envia automaticamente por e-mail via Yagmail."
        },
        "pokeHub": {
        "description": "Uma aplicação full-stack moderna que consome a PokeAPI para exibir informações sobre Pokémon, desenvolvida com Next.js no frontend e FastAPI no backend. Envolvendo IA e o desenvolvimento de análise de dados com consumo interno no Postman."
        },
        "emotionTrack": {
        "description": "Software baseado em Inteligência Artificial (IA) projetado para identificar e analisar microexpressões faciais em tempo real, com o objetivo de mapear emoções humanas durante interações remotas. O sistema integra um chatbot capaz de interpretar emoções em textos digitados e um dashboard que exibe análises de expressões faciais capturadas por webcam."
        }
    },
    "skills": {
        "title": "Habilidades",
        "introduction": "Sou um desenvolvedor versátil e adaptável com paixão por tecnologia e design. Destaco-me na criação de interfaces envolventes e amigáveis, usando HTML, CSS, JavaScript, TypeScript e React. Com experiência em Python (Django), Golang (Gin), entre outras linguagens, entrego projetos promissores no mercado de trabalho.",
        "html_css": {
        "title": "HTML & CSS",
        "description": "Experiência em criar interfaces atraentes e amigáveis, usando HTML e CSS, com foco em usabilidade e design responsivo."
        },
        "javascript_typescript": {
        "title": "JavaScript & TypeScript",
        "description": "Excelência no desenvolvimento de interfaces dinâmicas e interativas com JavaScript e TypeScript."
        },
        "react": {
        "title": "React/NextJS",
        "description": "Criação de aplicações interativas e de alto desempenho em React e Next.js, utilizando hooks e gerenciamento de estado para melhor usabilidade."
        },
        "python_django": {
        "title": "Python & Django",
        "description": "Desenvolvimento de soluções robustas e escaláveis com Python e Django, focando em eficiência e segurança. (Pandas, Streamlit, Numpy)"
        },
        "golang_gin": {
        "title": "GoLang & Gin",
        "description": "Implementação de aplicações backend de alto desempenho e baixa latência usando GoLang e o framework Gin."
        },
        "mysql_postgresql": {
        "title": "MySQL & PostgreSQL",
        "description": "Especialista em gerenciamento de bancos de dados com MySQL e PostgreSQL, garantindo integridade de dados e desempenho otimizado nas consultas."
        }
    }
}
  